package lotto;

public class Application {
    //1.입력: 로또 구입금액
    //2.로또 구매: 1개 1000원,
    //구입금액/1000 갯수만큼 구매
    //중복 예외처리
    //남는 금액 예외처리
    //3.입력: 당첨 번호 6자리, "," 로 구분 입력
    //4.입력: 보너스 번호
    //5.당첨 통계 계산
    //1) 각 구매 로또 리스트 탐색
    //만약 당첨번호 일치하는 것 있으면 카운트
    //만약 보너스 번호 맞으면 카운트
    //2) 당첨 갯수 계산
    //6개 일치
    //5개 일치, 보너스 볼 일치
    //5개 일치
    //4개 일치
    //3개 일치
    //3)수익률 계산
    public static void main(String[] args) {
        //TODO: 프로그램 구현
        //1.입력: 로또 구입금액
        //2.로또 구매: 1개 1000원,
        //구입금액/1000 갯수만큼 구매
        //중복 예외처리
        //남는 금액 예외처리
        //3.입력: 당첨 번호 6자리, "," 로 구분 입력
        //4.입력: 보너스 번호
        //5.당첨 통계 계산
        //1) 각 구매 로또 리스트 탐색
        //만약 당첨번호 일치하는 것 있으면 카운트
        //만약 보너스 번호 맞으면 카운트
        //2) 당첨 갯수 계산
        //6개 일치
        //5개 일치, 보너스 볼 일치
        //5개 일치
        //4개 일치
        //3개 일치
        //3)수익률 계산
    }
}
